Repository: swsnr/keep-me-awake
Catalog: po/*.po
Languages: de, et, fi, it, nl, zh_hans

source: Keep me Awake
et: Hoia mind ärkvel
nl: Niet in slaap vallen

source: Keep your desktop awake
de: Halte Deinen Desktop wach
et: Ära lase töölaual unne vajuda
fi: Pidä työpöytäsi valveilla
it: Mantieni il tuo computer sveglio
nl: Voorkom dat uw apparaat in de slaapstand gaat
zh_hans: 保持桌面处于唤醒状态

source: GNOME;GTK;Suspend;Idle;Inhibit;
de: GNOME;GTK;Ruhezustand;Suspend;Idle;Verhindern;
et: GNOME;GTK;Suspend;Idle;Inhibit;jõude;unumine;tukastama;tukasta;keela;luba;
fi: GNOME;GTK;Suspend;Idle;Inhibit;valmiustila;jouten;
it: GNOME;GTK;Suspend;Sospendi;Sospensione;Idle;Pausa;Inhibit;Inibisci;
nl: GNOME;GTK;Pauzestand;Slaapstand;Inactiviteit;Inactief;Voorkomen;Onderdrukken;
zh_hans: GNOME;GTK;Suspend;Idle;Inhibit;挂起;空闲;阻止;

source: Inhibit lock screen and suspend
de: Bildschirmsperre und Ruhezustand verhindern
et: Keela lukustusvaade ja unerežiim
fi: Estä näytön lukitus ja valmiustila
it: Inibisci il blocco schermo e la sospensione
nl: Schermvergrendeling en slaapstand onderdrukken
zh_hans: 阻止锁定屏幕和挂起

source: Inhibit lock screen and suspend of your desktop system, via the main user interface or via global shortcuts.
de: Verhindere die Bildschirmsperre und den Ruhezustand Deines Desktop-Systems, mittels des Hauptfensters oder durch globale Tastenkürzel.
et: Keela oma süle- või lauaarvuti lukustusvaade ja unerežiim kas kasutajaliidesest või üldiste kiirklahvidega.
fi: Estä lukitusnäytön aktivoituminen ja työpöytäjärjestelmän keskeytystila käyttäen graafista käyttöliittymää tai pikanäppäimiä.
it: Inibisci il blocco schermo e la sospensione del tuo computer, usando l'interfaccia principale o con le scorciatoie globali.
nl: Voorkom dat uw apparaat naar het vergrendelscherm of in de slaapstand gaat, via het menu of sneltoetsen.
zh_hans: 通过主用户界面或全局快捷键，阻止锁定屏幕和挂起桌面系统。

source: Suspend
de: Ruhezustand
et: Unerežiim
fi: Keskeytystila
it: Sospendi
nl: Slaapstand
zh_hans: 挂起

source: Inhibit
de: Verhindern
et: Keela
fi: Estä
it: Inibisci
nl: Onderdrukken
zh_hans: 阻止

source: Idle
et: Jõude
fi: Jouten
it: Inattivit√†
nl: Inactief
zh_hans: 空闲

source: Add global Super+W shortcut to toggle inhibiting sleep.
de: Ein globales Super+W Tastenkürzel wurde hinzugefügt, welches den Ruhezustand verhindert.
et: Lisasime üldise Super+W kiirklahv unerežiimi keelamiseks/lubamiseks.

source: Once started keep running in background to react to global shortcuts.
de: Nachdem die Anwendung gestartet wurde, läuft sie im Hintergrund weiter, um auf das globale Tastenkürzel zu reagieren.
et: Peale käivitamist jääb rakendus taustal tööle ja saab reageerida üldiste kiirklahvide vajutustele.

source: Add menu items to show application shortcuts and, in supported desktop environments, configure global shortcuts.
de: Menüeinträge wurden hinzugefügt, um die Tastenkürzel der Anwendung anzuzeigen, und, in unterstützten Desktop-Umgebungen, die globalen Tastenkürzel zu konfigurieren.
et: Lisasime menüüvaliku kiirklahvide jaoks ja kui töölauakeskkond seda toetab, ka võimaluse üldiste kiirklahvide seadistamiseks.

source: Inhibit suspend and session lock on startup.
de: Nach dem Start werden Ruhezustand und Bildschirmsperre direkt unterbunden.
et: Lukustusvaate ja unerežiimi keelamise võimalus käivitamisel.

source: Update translations.
de: Übersetzungen wurden aktualisiert.
et: Uuendatud tõlked.
fi: Päivitä käännökset.
it: Traduzioni aggiornate.
nl: Vertalingen bijgewerkt.
zh_hans: 更新翻译。

source: Update to GNOME 49.
de: Update auf GNOME 49.
et: Uuendus kasutab nüüd GNOME 49 teeke.
fi: Päivitä GNOME 49:ään.
nl: Bijgewerkt naar GNOME 49.

source: Global shortcuts are not yet supported.
de: Globale Tastenkürzel werden noch nicht unterstützt.
et: Üldised kiirklahvid pole veel toetatud.
fi: Yleisesti päteviä pikanäppäimiä ei vielä tueta.
nl: Globale sneltoetsen worden nog niet ondersteund.
zh_hans: 暂不支持全局快捷键。

source: Do not show redundant notification when quitting.
de: Beim Beenden wird keine unnötige Benachrichtigung mehr angezeigt.
et: Väljumisel ei kuva enam mittevajalikku teavitust.
fi: Älä näytä ylimääräistä ilmoitusta lopettaessasi.
nl: Toon geen melding tijdens het afsluiten.
zh_hans: 退出时不要显示多余的通知。

source: Show indicator if app was updated in background.
de: Ein Hinweis wird angezeigt, wenn die Anwendung im Hintergrund aktualisiert wurde.
et: Kui rakendust uuendatakse taustal, siis näitame graafilist indikaatorit.
fi: Näytä ilmaisin, jos sovellus päivitettiin taustalla.
nl: Toon een indicator als de toepassing op de achtergrond is bijgewerkt.
zh_hans: 如果应用在后台更新，则显示指示器。

source: Keep inhibiting screen lock even after the main window is closed.
de: Die Bildschirmsperre wird weiterhin verhindert, nachdem das Hauptfenster geschlossen wurde.
et: Lukustusvaate keelamine jätkub ka peale põhiakna sulgemist.
fi: Pidä näytön lukituksen esto päällä, vaikka pääikkuna olisi suljettu.
nl: Onderdruk het vergrendelscherm, ook als het hoofdvenster is afgesloten.
zh_hans: 即使在主窗口关闭后，也要保持阻止屏幕锁定。

source: Add persistent notification when sleep or screen lock are inhibited.
de: Eine dauerhafte Benachrichtigung wird angezeigt während Ruhezustand oder Bildschirmsperre verhindert werden.
et: Kui lukustusvaade ja unerežiim on keelatud, siis kuvame püsiteavitust.
fi: Lisää pysyvä ilmoitus, kun valmiustila tai näytön lukitus on estetty.
nl: Nieuw: permanente meldingen tijdens onderdrukken van slaapstand en schermvergrendeling.
zh_hans: 添加睡眠或屏幕锁定被阻止时的持久通知。

source: Correctly quit the app.
de: Die Anwendung wird korrekt beendet.
et: Rakenduse sulgemine toimib nüüd korrektselt.
fi: Sulje sovellus oikein.
nl: Opgelost: de toepassing wordt voortaan juist afgesloten.
zh_hans: 正确退出应用。

source: Add main window with toggles to inhibit either suspend, or suspend and screen lock.
de: Ein Hauptfenster wurde hinzugefügt mit Schaltflächen zum Verhindern des Ruhezustands, oder des Ruhezustands inklusive der Bildschirmsperre.
et: Lisandus nuppudega põhivaade, kus saab keelata lukustusvaade ja unerežiimi või need käivitada.
nl: Nieuw: acties in het hoofdvenster voor het onderdrukken van de slaapstand, schermvergrendeling of beide.
zh_hans: 添加带有开关的主窗口，以阻止挂起、或同时阻止挂起和屏幕锁定。

source: Global shortcuts and notifications are not yet supported.
de: Globale Tastenkürzel und Benachrichtigungen werden noch nicht unterstützt.
et: Üldised kiirklahvid ja teavitused pole veel toetatud.
fi: Yleisesti päteviä pikanäppäimiä ja ilmoituksia ei vielä tueta.
nl: Globale sneltoetsen en meldingen worden nog niet ondersteund.
zh_hans: 暂不支持全局快捷键和通知。

source: Inhibit nothing
de: Nichts verhindern
et: Vaade, mis näitab, et mitte midagi pole keelatud
fi: Älä estä mitään
it: Non inibire nulla
nl: Niets onderdrukken
zh_hans: 不进行任何阻止

source: Inhibit suspend and screen locking
de: Ruhezustand und Bildschirmsperre verhindern
et: Lukustusvaade ja unerežiim on keelatud
fi: Estä valmiustila ja näytön lukitus
it: Inibisci la sospensione e il blocco schermo
nl: Schermvergrendeling en slaapstand onderdrukken
zh_hans: 阻止挂起和屏幕锁定

# application-window.menu.label
source: _Quit
de: _Beenden
et: _Välju
fi: _Lopeta
it: _Esci
nl: _Afsluiten
zh_hans: 退出(_Q)

# application-window.menu.label
source: Configure _global shortcuts
de: _Globale Tastenkürzel konfigurieren
et: Seadista üldisi _kiirklahve

# application-window.menu.label
source: _Shortcuts
de: _Tastenkürzel
et: _Kiirklahvid

# application-window.menu.label
source: _About Keep me Awake
de: _Info zu Keep me Awake
et: R_akenduse teave: Hoia mind ärkvel

source: Do not inhibit screen lock and suspend
de: Bildschirmsperre und Ruhezustand erlauben
et: Ära keela lukustusvaadet ja unerežiimi
fi: Älä estä näytön lukitusta ja valmiustilaa
it: Non inibire il blocco schermo e la sospensione
nl: Schermvergrendeling en slaapstand niet onderdrukken
zh_hans: 不要阻止屏幕锁定和挂起

source: Inhibit suspend
de: Ruhezustand verhindern
et: Keela unerežiim
fi: Estä valmiustila
it: Inibisci la sospensione
nl: Slaapstand onderdrukken
zh_hans: 阻止挂起

source: Inhibit screen lock and suspend
de: Bildschirmsperre und Ruhezustand verhindern
et: Keela lukustusvaade ja unerežiim
fi: Estä näytön lukitus ja valmiustila
it: Inibisci il blocco schermo e la sospensione
nl: Schermvergrendeling en slaapstand onderdrukken
zh_hans: 阻止屏幕锁定和挂起

# shortcuts section
source: Global shortcuts
de: Globale Tastenkürzel
et: Üldised kiirklahvid

# shortcuts section
source: General
de: Allgemein
et: Üldised

# shortcut item title
source: Show shortcuts
de: Tastenkürzel anzeigen
et: Näita kiirklahve

# shortcut item title
source: Quit
de: Beenden
et: Välju

# about-dialog.link.label
source: Translations
de: Übersetzungen
et: Tõlked
fi: Käännökset
it: Traduzioni
nl: Vertalingen
zh_hans: 翻译

source: translator-credits
de: Sebastian Wiesner <sebastian@swsnr.de>
et: Priit Jõerüüt 2025
fi: Jiri Grönroos
it: bordam<https://github.com/bordam/>
nl: Heimen Stoffels <vistausss@fastmail.com>
zh_hans: Outbreak2096

# about-dialog.acknowledgment-section
source: Helpful services
de: Hilfreiche Dienste
et: Abiks olevad teenused
fi: Hyödylliset palvelut
it: Servizi utili
nl: Nuttige diensten
zh_hans: 辅助服务

# about-dialog.other-app.name
source: Picture Of The Day
de: Bild des Tages
et: Päevapilt
fi: Päivän kuva
nl: Afbeelding van de dag
zh_hans: 今日图片

# about-dialog.other-app.summary
source: Your daily wallpaper
de: Dein täglicher Bildschirmhintergrund
et: Sinu igapäevane taustapilt
fi: Päivittäinen taustakuva
nl: Uw dagelijkse achtergrond
zh_hans: 您的每日壁纸

# about-dialog.other-app.name
source: Turn On
de: Anschalten
et: Lülita sisse
fi: Kytke päälle
nl: Aanzetten

# about-dialog.other-app.summary
source: Turn on devices in your network
de: Geräte in Deinem Netzwerk anschalten
et: Lülita seadmed oma võrgus sisse
fi: Kytke verkossasi olevat laitteet päälle
nl: Schakel apparaten op uw netwerk in
zh_hans: 打开网络中的设备

# portal.request-background.reason
source: Inhibit suspend and idle without a main window
de: Ruhezustand und Bildschirmsperre ohne Hauptfenster verhindern
et: Keela jõudeolek ja unerežiim ilma põhivaadet kasutamata

# notification.title
source: Suspend inhibited
de: Ruhezustand wird verhindert
et: Unerežiim on keelatud
fi: Valmiustila estetty
it: Sospensione inibita
nl: Slaapstand is onderdrukt
zh_hans: 挂起被阻止

# notification.body
source: Keep me Awake inhibits suspend at your request.
de: Keep me Awake verhindert den Ruhezustand auf Deinen Wunsch.
et: Rakendus „Hoia mind ärkvel“ on sinu palvel keelanud arvuti unerežiimi.

# notification.title
source: Suspend and screen lock inhibited
de: Ruhezustand und Bildschirmsperre werden verhindert
et: Lukustusvaade ja unerežiim on keelatud
fi: Valmiustila ja näytön lukitus estetty
it: Sospensione e blocco schermo inibiti
nl: Slaapstand en schermvergrendeling zijn onderdrukt
zh_hans: 挂起和屏幕锁定被阻止

# notification.body
source: Keep me Awake inhibits suspend and screen lock at your request.
de: Keep me Awake verhindert den Ruhezustand und die Bildschirmsperre auf Deinen Wunsch.
et: Rakendus „Hoia mind ärkvel“ on sinu palvel keelanud arvuti unerežiimi ja lukustusvaate.

# global shortcut description
source: Toggle Keep me Awake
de: Keep me Awake umschalten
et: Lülita „Hoia mind ärkvel“ sisse/välja

# inhibit-reason
source: Keep me Awake inhibits suspend at your request.
de: Keep me Awake verhindert den Ruhezustand auf Deinen Wunsch.
et: Rakendus „Hoia mind ärkvel“ on sinu palvel keelanud arvuti unerežiimi.

# about-dialog.license-text
source: Copyright {copyright_name} &lt;{copyright_email}&gt; Licensed under the terms of the EUPL 1.2. You can find official translations of the license text at <a href="{translations}">{translations}</a>. The full English text follows. {license_text}
de: Copyright {copyright_name} &lt;{copyright_email}&gt; Lizenziert unter den Bedingungen der EUPL 1.2. Unter <a href="{translations}">{translations}</a> kannst Du eine offizielle Übersetzung der Lizenz finden. Es folgt der vollständige englische Text. {license_text}
et: Autoriõigused {copyright_name} &lt;{copyright_email}&gt; Litsentseeritud EUPL 1.2 alusel. Selle litsentsi ametliku tõlke leiad siit: <a href="{translations}">{translations}</a>. Täismahuline ingliskeelne tekst on alljärgnevas. {license_text}
fi: Tekijänoikeus {copyright_name} &lt;{copyright_email}&gt; Lisensoitu EUPL 1.2 :n ehtojen mukaisesti. Löydät lisenssitekstin viralliset käännökset osoitteesta <a href="{translations}">{translations</a>. Koko englanninkielinen teksti on seuraavassa. {license_text}
nl: Auteursrecht {copyright_name} &lt;{copyright_email}&gt; Uitgebracht onder de voorwaarden van de EUPL 1.2-licentie. OfficiÃ«le vertalingen van de licentietekst zijn beschikbaar op <a href="{translations}">{translations}</a>. Hieronder vindt u de Engelstalige tekst. {license_text}

# application-name
source: Keep me Awake
et: Hoia mind ärkvel

source: Keep Me Awake
it: Mantienimi sveglio
zh_hans: 保持唤醒

# application-window.menu.label
source: _About Keep Me Awake
it: _Informazioni su Mantienimi sveglio
zh_hans: 关于保持唤醒(_A)

# inhibit-reason
source: Keep Me Awake inhibits suspend at your request.
it: Mantienimi sveglio inibisce la sospensione su tua richiesta.
zh_hans: 保持唤醒根据您的要求阻止挂起。

# inhibit-reason
source: Keep Me Awake inhibits suspend and screen lock at your request.
it: Mantienimi sveglio inibisce la sospensione e il blocco schermo su tua richiesta.
zh_hans: 保持唤醒根据您的要求阻止挂起和屏幕锁定。

# notification.body
source: Keep Me Awake inhibits suspend at your request.
it: Mantienimi sveglio inibisce la sospensione su tua richiesta.
zh_hans: 保持唤醒根据您的要求阻止挂起。

# notification.body
source: Keep Me Awake inhibits suspend and screen lock at your request.
it: Mantienimi sveglio inibisce la sospensione e il blocco schermo su tua richiesta.
zh_hans: 保持唤醒根据您的要求阻止挂起和屏幕锁定。

# about-dialog.license-text
source: Copyright Sebastian Wiesner &lt;sebastian@swsnr.de&gt; Licensed under the terms of the EUPL 1.2. You can find official translations of the license text at <a href="%1">%1</a>. The full English text follows. %2
zh_hans: 版权所有 Sebastian Wiesner &lt;sebastian@swsnr.de&gt; 根据 EUPL 1.2 条款授权。您可以在 <a href="%1">%1</a> 找到许可证文本的官方译本。 完整的英文文本如下。 %2

# application-name
source: Keep Me Awake
it: Mantienimi sveglio
zh_hans: 保持唤醒
